Tekla Open API Reference for Tekla Structures 2025
RebarLegFace.Reversed Property
 Gets or sets a value indicating whether the cover thickness is opposite to the coordinate system Z direction for the rebar leg face.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Reversed { get; set; }
Public Property Reversed As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebarLegFace Class
Tekla.Structures.Model Namespace